[{"title": "Two of a Space Kind: Apollo 12 and Mars 2020", "article": "Apollo 12 and the upcoming Mars 2020 mission may be separated by half a century, but they share several goals unique in the annals of space exploration."}, {"title": "NASA's Mars Rover Drivers Need Your Help", "article": "Using an online tool to label Martian terrain types, you can train an artificial intelligence algorithm that could improve the way engineers guide the Curiosity rover."}, {"title": "InSight's 'Mole' Team Peers into the Pit", "article": "Efforts to save the heat probe continue."}, {"title": "A Martian Roundtrip: NASA's Perseverance Rover Sample Tubes", "article": "Marvels of engineering, the rover's sample tubes must be tough enough to safely bring Red Planet samples on the long journey back to Earth in immaculate condition. "}, {"title": "NASA's Briefcase-Size MarCO Satellite Picks Up Honors", "article": "The twin spacecraft, the first of their kind to fly into deep space, earn a Laureate from Aviation Week & Space Technology."}, {"title": "My Culture, My Voice", "article": "In honor of Hispanic Heritage Month, Christina Hernandez, an instrument engineer on the Mars 2020 mission, talks about her childhood and journey to NASA."}, {"title": "Follow NASA's Perseverance Rover in Real Time on Its Way to Mars", "article": "A crisply rendered web application can show you where the agency's Mars 2020 mission is right now as it makes its way to the Red Planet for a Feb. 18, 2021, landing."}, {"title": "From JPL's Mailroom to Mars and Beyond", "article": "Bill Allen has thrived as the mechanical systems design lead for three Mars rover missions, but he got his start as a teenager sorting letters for the NASA center."}, {"title": "10.9 Million Names Now Aboard NASA's Perseverance Mars Rover", "article": "As part of NASA's 'Send Your Name to Mars' campaign, they've been stenciled onto three microchips along with essays from NASA's 'Name the Rover' contest. Next stop: Mars."}, {"title": "Hear Audio From NASA's Perseverance As It Travels Through Deep Space", "article": "The first to be rigged with microphones, the agency's latest Mars rover picked up the subtle sounds of its own inner workings during interplanetary flight."}, {"title": "The Man Who Wanted to Fly on Mars", "article": "The Mars Helicopter is riding to the Red Planet this summer with NASA's Perseverance rover. The helicopter's chief engineer, Bob Balaram, shares the saga of how it came into being."}, {"title": "MOXIE Could Help Future Rockets Launch Off Mars", "article": "NASA's Perseverance rover carries a device to convert Martian air into oxygen that, if produced on a larger scale, could be used not just for breathing, but also for fuel."}, {"title": "Media Get a Close-Up of NASA's Mars 2020 Rover", "article": "The clean room at NASA's Jet Propulsion Laboratory was open to the media to see NASA's next Mars explorer before it leaves for Florida in preparation for a summertime launch."}, {"title": "Air Deliveries Bring NASA's Perseverance Mars Rover Closer to Launch", "article": "A NASA Wallops Flight Facility cargo plane transported more than two tons of equipment — including the rover's sample collection tubes — to Florida for this summer's liftoff."}, {"title": "Meet the People Behind NASA's Perseverance Rover", "article": "These are the scientists and engineers who built NASA's next Mars rover and who will guide it to a safe landing in Jezero Crater. "}]